soap1.2.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
    <soap12:Body>
        <getWeatherbyCityName xmlns="http://WebXml.com.cn/">
            <theCityName>广州</theCityName>
        </getWeatherbyCityName>
    </soap12:Body>
</soap12:Envelope>